{
  "details": {
    "summary": "Validate whether Update Contact API should return error when contact's aboutMe length is greater than the permissible aboutMe length limit",
    "description": "Example of negative test case. As aboutMe field length cannot exceeds 500, and we are setting aboutMe having length greater than 500 and checking whether the system is returning the proper error or not."
  },
  "validation": {
    "assertions": [
      {
        "source": "statusCode",
        "operator": "equalToNumber",
        "expectedValue": "400"
      },
      {
        "source": "jsonBody",
        "property": "errors.aboutMe",
        "operator": "equals",
        "expectedValue": "field length cannot be greater than 500"
      }
    ]
  },
  "request": {
    "url": "{{contactsAppBaseURLV2}}/contacts/{{contactId}}",
    "method": "PUT",
    "headers": {
      "Accept": "application/json, text/javascript, */*; q=0.01",
      "Content-Type": "application/json",
      "X-Requested-With": "XMLHttpRequest"
    },
    "body": {
      "content": {
        "_id": "{{contactId}}",
        "name": "John Doe",
        "email": "john.doe@example.com",
        "designation": "Chief Technical Officer",
        "organization": "Example.com",
        "country": "India",
        "aboutMe": "Sample aboutMe field whose length is greater than the limit. Sample aboutMe field whose length is greater than the limit. Sample aboutMe field whose length is greater than the limit. Sample aboutMe field whose length is greater than the limit. Sample aboutMe field whose length is greater than the limit. Sample aboutMe field whose length is greater than the limit. Sample aboutMe field whose length is greater than the limit. Sample aboutMe field whose length is greater than the limit. Sample aboutMe field whose length is greater than the limit. Sample aboutMe field whose length is greater than the limit. Sample aboutMe field whose length is greater than the limit. Sample aboutMe field whose length is greater than the limit. Sample aboutMe field whose length is greater than the limit. Sample aboutMe field whose length is greater than the limit. Sample aboutMe field whose length is greater than the limit. Sample aboutMe field whose length is greater than the limit. Sample aboutMe field whose length is greater than the limit. Sample aboutMe field whose length is greater than the limit. Sample aboutMe field whose length is greater than the limit. Sample aboutMe field whose length is greater than the limit. Sample aboutMe field whose length is greater than the limit.",
        "twitterId": "fake.john.doe",
        "facebookId": "fake.john.doe",
        "githubId": "fake.john.doe",
        "createdOn": "2014-05-03T06:28:45.479Z"
      },
      "type": "json"
    }
  }
}